[
  {
    "id": "Chambermaid",
    "hatred": [
      {
        "id": "Mathematician",
        "reason": "La Femme de chambre apprend si le Mathématicien va se réveiller, même si elle se réveille avant lui."
      }
    ]
  },
  {
    "id": "Philosopher",
    "hatred": [
      {
        "id": "Bounty Hunter",
        "reason": "Si le Philosophe gagne la capacité du Mercenaire, il se peut qu'un Villageois devienne mauvais."
      }
    ]
  },
  {
    "id": "Cannibal",
    "hatred": [
      {
        "id": "Juggler",
        "reason": "Si le Jongleur a deviné des rôles durant son premier jour et est alors mort par exécution, le Cannibale apprend cette nuit combien de rôles le Jongleur a deviné correctement."
      },
      {
        "id": "Poppy Grower",
        "reason": "Si le Cannibale mange le Planteur de pavot, puis meurt ou perd la capacité du Planteur de pavot, le Démon et les Sbires apprennent qui sont leurs alliés cette nuit."
      },
      {
        "id": "Butler",
        "reason": "Si le Cannibale gagne la capacité du Majordome, il l'apprend."
      },
      {
        "id": "Zealot",
        "reason": "Si le Cannibale gagne la capacité du Fanatique, il l'apprend."
      }
    ]
  },
  {
    "id": "Ogre",
    "hatred": [
      {
        "id": "Recluse",
        "reason": "Si le Reclus apparaît comme mauvais pour l'Ogre, l'Ogre apprend qu'il devient mauvais."
      }
    ]
  },
  {
    "id": "Lunatic",
    "hatred": [
      {
        "id": "Mathematician",
        "reason": "Le Mathématicien apprend si l'Aliéné attaque des joueur(s) différent(s) du véritable Démon."
      }
    ]
  },
  {
    "id": "Godfather",
    "hatred": [
      {
        "id": "Heretic",
        "reason": "Seul un de ces personnages peut être en jeu."
      }
    ]
  },
  {
    "id": "Spy",
    "hatred": [
      {
        "id": "Alchemist",
        "reason": "L'Alchimiste ne peut pas avoir la capacité de l'Espion."
      },
      {
        "id": "Magician",
        "reason": "Quand l'Espion regarde le Grimoire, les jetons du Démon et du Magicien sont retirés."
      },
      {
        "id": "Poppy Grower",
        "reason": "Si le Planteur de pavot est en jeu, l'Espion ne regarde pas le Grimoire avant la mort du Planteur de pavot."
      },
      {
        "id": "Ogre",
        "reason": "L'Espion apparaît comme mauvais pour l'Ogre."
      },
	  {
        "id": "Plague Doctor",
        "reason": "Si le Médecin de Peste aurait du donner la capacité d'Espion au Narrateur, un Sbire en vie gagne la capacité d'Espion en plus de sa propre capacité, et l'apprend."
      },
      {
        "id": "Damsel",
        "reason": "Si l'Espion est (ou a été) en jeu, la Demoiselle est empoisonnée."
      },
      {
        "id": "Heretic",
        "reason": "Seul un de ces personnages peut être en jeu."
      }
    ]
  },
  {
    "id": "Cerenovus",
    "hatred": [
      {
        "id": "Goblin",
        "reason": "Le Cerenovus peut choisir de rendre un joueur persuadé d'être le Gobelin."
      }
    ]
  },
  {
    "id": "Fearmonger",
    "hatred": [
      {
        "id": "Plague Doctor",
        "reason": "Si le Médecin de Peste aurait du donner la capacité de Semeur de peur au Narrateur, un Sbire en vie gagne la capacité de Semeur de peur en plus de sa propre capacité, et l'apprend."
      }
    ]
  },
  {
    "id": "Pit-Hag",
    "hatred": [
      {
        "id": "Village Idiot",
        "reason": "S'il y a moins de trois Idiots du Village, le Chaudronnier peut en créer un nouveau. Il se peut alors que l'Idiot du Village ivre change."
      },
      {
        "id": "Cult Leader",
        "reason": "Si le Chaudronnier change un joueur mauvais en Gourou, celui-ci ne peut pas devenir bon par sa capacité."
      },
      {
        "id": "Goon",
        "reason": "Si le Chaudronnier change un joueur mauvais en Homme de main, celui-ci ne peut pas devenir bon par sa capacité."
      },
      {
        "id": "Ogre",
        "reason": "Si le Chaudronnier change un joueur mauvais en Ogre, celui-ci ne peut pas devenir bon par sa capacité."
      },
      {
        "id": "Politician",
        "reason": "Si le Chaudronnier change un joueur mauvais en Politicien, celui-ci ne peut pas devenir bon par sa capacité."
      },
      {
        "id": "Damsel",
        "reason": "Si le Chaudronnier crée une Demoiselle, le Narrateur choisit quel joueur le devient"
      },
      {
        "id": "Heretic",
        "reason": "Le Chaudronnier ne peut pas créer un Hérétique."
      }
    ]
  },
  {
    "id": "Widow",
    "hatred": [
      {
        "id": "Alchemist",
        "reason": "L'Alchimiste ne peut pas avoir la capacité de la Veuve."
      },
      {
        "id": "Magician",
        "reason": "Quand la Veuve regarde le Grimoire, les jetons du Démon et du Magicien sont retirés."
      },
      {
        "id": "Poppy Grower",
        "reason": "Si le Planteur de pavot est en jeu, la Veuve ne regarde pas le Grimoire avant la mort du Planteur de pavot."
      },
      {
        "id": "Damsel",
        "reason": "Si la Veuve est (ou a été) en jeu, la Demoiselle est empoisonnée."
      },
      {
        "id": "Heretic",
        "reason": "Seul un de ces personnages peut être en jeu."
      }
    ]
  },
  {
    "id": "Marionette",
    "hatred": [
      {
        "id": "Balloonist",
        "reason": "Si la Marionnette pense être l'Aéronaute, il se peut qu'1 Etranger ait été ajouté."
      },
      {
        "id": "Huntsman",
        "reason": "Si la Marionnette pense être le Chasseur, la Demoiselle a été ajoutée."
      },
      {
        "id": "Poppy Grower",
        "reason": "Quand le Planteur de pavot meurt, le Démon apprend qui est la Marionnette, mais la Marionnette n'apprend rien."
      },
      {
        "id": "Plague Doctor",
        "reason": "Si l'un des voisins du Démon est un Villageois ou Étranger et est vivant quand le Narrateur aurait du gagner la capacité de la Marionnette, ce joueur devient une Marionnette mauvaise. S'il y a déjà un joueur mauvais supplémentaire, cela n'arrive pas."
      },
      {
        "id": "Damsel",
        "reason": "La Marionnette n'apprend pas qu'une Demoiselle est en jeu."
      },
      {
        "id": "Snitch",
        "reason": "La Marionnette n'apprend pas 3 personnages qui ne sont pas en jeu. Le Démon en apprend 3 suplémentaires à la place."
      },
      {
        "id": "Lil' Monsta",
        "reason": "La Marionnette est voisine d'un Sbire, pas du Démon. La Marionnette n'est pas réveillée pour décider qui a la garde du Bébé Monstre, et n'apprend pas qu'elle est Marionnette si elle devient baby-sitter."
      }
    ]
  },
  {
    "id": "Evil Twin",
    "hatred": [
      {
        "id": "Plague Doctor",
        "reason": "Le Narrateur ne peut pas gagner la capacité du Jumeau maléfique si le Médecin de Peste meurt."
      }
    ]
  },
  {
    "id": "Summoner",
    "hatred": [
      {
        "id": "Clockmaker",
        "reason": "Si l'Invocateur est en jeu, l'Horloger ne reçoit aucune info jusqu'à ce qu'un Démon soit créé."
      },
      {
        "id": "Preacher",
        "reason": "Si le Prêcheur désigne l'Invocateur durant la troisième nuit ou avant, l'Invocateur choisit quel Démon mais le Narrateur choisit quel joueur."
      },
      {
        "id": "Engineer",
        "reason": "Si l'Ingénieur retire l'Invocateur avant que celui-ci n'ait utilisé sa capacité, l'Invocateur utilise sa capacité immédiatement."
      },
      {
        "id": "Courtier",
        "reason": "Si l'Invocateur est ivre durant la troisième nuit, l'Invocateur choisit quel Démon mais le Narrateur choisit quel joueur."
      },
      {
        "id": "Alchemist",
        "reason": "Si un Alchimiste-Invocateur est en jeu, la partie commence avec un Démon, comme d'habitude. Si l'Alchimiste-Invocateur désigne un joueur, il le transforme en Démon mais ne change pas son alignement."
      },
      {
        "id": "Poppy Grower",
        "reason": "Si le Planteur de pavot est en vie lorsque l'Invocateur agit, l'Invocateur choisit quel Démon mais le Narrateur choisit quel joueur."
      },
      {
        "id": "Hatter",
        "reason": "L'Invocateur ne peut pas créer un Démon en jeu. Si l'Invocateur crée un Démon qui n'est pas en jeu, les morts cette nuit sont arbitraires."
      },
      {
        "id": "Pit-Hag",
        "reason": "L'Invocateur ne peut pas créer un Démon en jeu. Si l'Invocateur crée un Démon qui n'est pas en jeu, les morts cette nuit sont arbitraires."
      },
      {
        "id": "Marionette",
        "reason": "La Marionnette est voisine de l'Invocateur. L'Invocateur sait qui est la Marionnette."
      },
      {
        "id": "Pukka",
        "reason": "L'Invocateur peut choisir de changer un joueur en Pukka durant la deuxième nuit."
      },
      {
        "id": "Kazali",
        "reason": "L'Invocateur ne peut pas créer un Démon en jeu. Si l'Invocateur crée un Démon qui n'est pas en jeu, les morts cette nuit sont arbitraires."
      },
      {
        "id": "Zombuul",
        "reason": "Si l'Invocateur change un joueur mort en Zombuul, le Narrateur traite ce joueur comme un Zombuul qui est mort une fois."
      },
	  {
        "id": "Legion",
        "reason": "Si l'Invocateur crée une Légion, la majorité des joueurs (y compris les joueurs mauvais) deviennent des Légions mauvaises."
      },
      {
        "id": "Lord of Typhon",
        "reason": "Si l'Invocateur créé un Maître de Typhon, ce Maître de Typhon doit être voisin d'un Sbire. Son autre voisin devient un mauvais Sbire qui n'était pas en jeu."
      },
      {
        "id": "Riot",
        "reason": "Si l'Invocateur crée une Émeute, tous les Sbires deviennent également des Émeutes."
      }
    ]
  },
  {
    "id": "Goblin",
    "hatred": [
      {
        "id": "Plague Doctor",
        "reason": "Si le Médecin de Peste aurait du donner la capacité de Gobelin au Narrateur, un Sbire en vie gagne la capacité de Gobelin en plus de sa propre capacité, et l'apprend."
      }
    ]
  },
  {
    "id": "Boomdandy",
    "hatred": [
      {
        "id": "Plague Doctor",
        "reason": "Si le Médecin de Peste est exécuté et que le Narrateur aurait du gagner une capacité d'Homme-bombe, la capacité d'Homme-bombe s'active immédiatement."
      }
    ]
  },
  {
    "id": "Mastermind",
    "hatred": [
      {
        "id": "Al-Hadikhia",
        "reason": "Si l'Al-Hadikhia meurt par exécution, et si le Cerveau est en vie, l'Al-Hadikhia désigne trois joueurs bons cette nuit. Si tous choisit de vivre, les mauvais gagnent ; sinon, les bons gagnent."
      }
    ]
  },
  {
    "id": "Scarlet Woman",
    "hatred": [
      {
        "id": "Plague Doctor",
        "reason": "Si le Médecin de Peste aurait du donner la capacité de Gourgandine au Narrateur, un Sbire en vie gagne la capacité de Gourgandine en plus de sa propre capacité, et l'apprend."
      }
    ]
  },
  {
    "id": "Vizier",
    "hatred": [
      {
        "id": "Investigator",
        "reason": "Si l'Enquêteur apprend qu'un Vizir est en jeu, la présence du Vizir n'est pas annoncée par le Narrateur."
      },
      {
        "id": "Preacher",
        "reason": "Si le Vizir perd sa capacité, il l'apprend. Si le Vizir est exécuté alors qu'il a sa capacité, son équipe gagne."
      },
      {
        "id": "Alsaahir",
        "reason": "Si le Vizir est en jeu, l'Alsaahir doit également deviner quel(s) Démon(s) sont en jeu."
      },
      {
        "id": "Courtier",
        "reason": "Si le Vizir perd sa capacité, il l'apprend. Si le Vizir est exécuté alors qu'il a sa capacité, son équipe gagne."
      },
      {
        "id": "Alchemist",
        "reason": "Si l'Alchimiste a la capacité du Vizir, il peut exécuter si et seulement si au moins trois joueurs votent, peu importe leur alignement."
      },
	  {
        "id": "Magician",
        "reason": "Si le Vizir et le Magicien sont tous deux en jeu, le Démon n'apprend pas qui sont les Sbires."
      },
      {
        "id": "Politician",
        "reason": "Il se peut que le Politicien apparaisse comme mauvais pour le Vizir."
      },
      {
        "id": "Zealot",
        "reason": "Il se peut que le Fanatique apparaisse comme mauvais pour le Vizir."
      },
      {
        "id": "Fearmonger",
        "reason": "Le Vizir se réveille avec le Semeur de peur, apprend quel joueur celui-ci choisit, et ne peut pas exécuter ce joueur."
      }
    ]
  },
  {
    "id": "Organ Grinder",
    "hatred": [
      {
        "id": "Butler",
        "reason": "Si les votes ont lieu à bulletin secret à cause de l'Organiste barbare, le Majordome peut lever sa main mais son vote ne compte que si son maître la lève aussi."
      }
    ]
  },
  {
    "id": "Boffin",
    "hatred": [
      {
        "id": "Village Idiot",
        "reason": "S'il y a moins de trois Idiots du Village, le Spécialiste peut donner au Démon la capacité de l'Idiot du Village."
      },
      {
        "id": "Cult Leader",
        "reason": "Si le Démon a la capacité du Gourou, il ne peut pas devenir bon par sa capacité."
      },
      {
        "id": "Alchemist",
        "reason": "Si l'Alchimiste a la capacité du Spécialiste, il n'apprend pas quelle est la capacité de bon du Démon."
      },
      {
        "id": "Goon",
        "reason": "Si le Démon a la capacité de l'Homme de main, il ne peut pas devenir bon par sa capacité."
      },
      {
        "id": "Ogre",
        "reason": "Le Démon ne peut pas avoir la capacité de l'Ogre."
      },
      {
        "id": "Drunk",
        "reason": "Si le Démon devrait avoir la capacité de l'Ivrogne, le Spécialiste choisit un joueur Villageois qui aura cette capacité à sa place."
      },
      {
        "id": "Politician",
        "reason": "Le Démon ne peut pas avoir la capacité du Politicien."
      },
	  {
        "id": "Heretic",
        "reason": "Le Démon ne peut pas avoir la capacité de l'Hérétique."
      }
    ]
  },
  {
    "id": "Baron",
    "hatred": [
      {
        "id": "Plague Doctor",
        "reason": "Si le Narrateur gagne la capacité du Baron, jusqu'à deux joueurs deviennent des Étrangers qui ne sont pas en jeu."
      },
	  {
        "id": "Heretic",
        "reason": "Il se peut que le Baron ajoute un Étranger au lieu de deux."
      }
    ]
  },
  {
    "id": "Yaggababble",
    "hatred": [
      {
        "id": "Exorcist",
        "reason": "Si l'Exorciste désigne le Yaggablabla, la capacité du Yaggablabla ne tue personne cette nuit."
      }
    ]
  },
  {
    "id": "Lil' Monsta",
    "hatred": [
      {
        "id": "Magician",
        "reason": "Chaque nuit, le Magicien choisit un rôle de Sbire : si ce Sbire et le Bébé monstre sont vivants, ce Sbire a la garde du Bébé monstre."
      },
      {
        "id": "Poppy Grower",
        "reason": "Si le Planteur de pavot est en jeu, les Sbires ne se réveillent pas ensemble. Ils sont réveillés un par un jusqu'à ce que l'un d'entre eux décide d'être baby-sitter."
      },
      {
        "id": "Hatter",
        "reason": "Si un Démon choisit de devenir Bébé monstre, il choisit aussi le Sbire qu'il devient et a la garde du Bébé monstre cette nuit."
      },
      {
        "id": "Scarlet Woman",
        "reason": "S'il y a au moins 5 joueurs en vie au moment de la mort du baby-sitter, la Gourgandine récupére la garde du Bébé Monstre cette nuit."
      },
      {
        "id": "Vizier",
        "reason": "Le Vizir peut mourir par exécution s'il a la garde du Bébé Monstre."
      }
    ]
  },
  {
    "id": "Kazali",
    "hatred": [
      {
        "id": "Bounty Hunter",
        "reason": "Un Villageois ne devient mauvais que si le Mercenaire est toujours en jeu après l'action du Kazali."
      },
      {
        "id": "Huntsman",
        "reason": "Si le Kazali transforme la Demoiselle en Sbire, et si le Chasseur est en jeu, un joueur bon devient Demoiselle."
      },
      {
        "id": "Soldier",
        "reason": "Le Kazali peut choisir que le Soldat devient un de ses mauvais Sbires."
      },
      {
        "id": "Choirboy",
        "reason": "Le Kazali ne peut pas choisir de changer le Roi en Sbire si l'Enfant de choeur est en jeu."
      },
      {
        "id": "Goon",
        "reason": "Le Kazali peut choisir que l'Homme de main devient un de ses mauvais Sbires."
      },
      {
        "id": "Marionette",
        "reason": "Si le Kazali veut créer une Marionnette, il doit choisir l'un de ses voisins."
      }
    ]
  },
  {
    "id": "Al-Hadikhia",
    "hatred": [
      {
        "id": "Scarlet Woman",
        "reason": "S'il y a deux Al-Hadikhias en vie, la Gourgandine devenue Al-Hadikhia redevient Gourgandine."
      }
    ]
  },
  {
    "id": "Vortox",
    "hatred": [
      {
        "id": "Banshee",
        "reason": "Même si le Vortox est en jeu quand le Démon tue la Banshee, les joueurs apprennent que la Banshee est morte."
      }
    ]
  },
  {
    "id": "Fang Gu",
    "hatred": [
      {
        "id": "Scarlet Woman",
        "reason": "Si le Fang Gu désigne un Étranger et meurt, La Gourgandine ne devient pas le Fang Gu."
      }
    ]
  },
  {
    "id": "Legion",
    "hatred": [
      {
        "id": "Preacher",
        "reason": "Si le Prêcheur désigne une Légion, la Légion garde sa capacité, mais il se peut que le Prêcheur apprenne que ce joueur est une Légion."
      },
      {
        "id": "Engineer",
        "reason": "La Légion et l'Ingénieur ne peuvent pas être tous les deux en jeu au début de la partie. Si l'Ingénieur crée une Légion, la majorité des joueurs (y compris tous les joueurs mauvais) deviennent des Légions mauvaises."
      },
      {
        "id": "Minstrel",
        "reason": "Si une Légion meurt par exécution, la Légion garde sa capacité, mais il se peut que le Ménestrel apprenne que ce joueur est une Légion."
      },
	  {
        "id": "Hatter",
        "reason": "Si le Chapelier meurt alors que la Légion est en jeu, rien ne se passe. Si le Chapelier meurt et qu'un mauvais choisit de devenir Légion, tous les joueurs mauvais deviennent Légion."
      },
	  {
        "id": "Zealot",
        "reason": "Il se peut que le Fanatique apparaisse comme mauvais pour la capacité de la Légion."
      }
    ]
  },
  {
    "id": "Lleech",
    "hatred": [
      {
        "id": "Slayer",
        "reason": "Si le Tueur tire sur l'hôte de la Ssangssue, l'hôte meurt."
      },
      {
        "id": "Heretic",
        "reason": "Si la Ssangssue a empoisonné l'Hérétique, et si elle meurt, alors l'Hérétique reste empoisonné."
      },
	  {
        "id": "Mastermind",
        "reason": "Si le Cerveau est en vie et que l'hôte de la Ssangssue meurt par execution, la Ssangssue survit mais perd sa capacité."
      }
    ]
  },
  {
    "id": "Leviathan",
    "hatred": [
      {
        "id": "Innkeeper",
        "reason": "Si le Léviathan accuse et exécute un joueur protégé par l'Aubergiste, ce joueur ne meurt pas."
      },
      {
        "id": "Monk",
        "reason": "Si le Léviathan accuse et exécute un joueur protégé par le Moine, ce joueur ne meurt pas."
      },
	  {
        "id": "Soldier",
        "reason": "Si le Léviathan accuse et exécute le Soldat, le Soldat ne meurt pas."
      },
      {
        "id": "Farmer",
        "reason": "Si le Léviathan est en jeu et qu'un Fermier meurt par éxécution, un joueur bon devient Fermier cette nuit."
      },	  
      {
        "id": "Ravenkeeper",
        "reason": "Si le Léviathan est en jeu et que l'Ami des corbeaux meurt par exécution, il se réveille cette nuit pour utiliser sa capacité. Il est ivre si son accusateur était bon."
      },
      {
        "id": "Sage",
        "reason": "Si le Léviathan est en jeu et que le Sage meurt par execution, il se réveille cette nuit pour utiliser sa capacité. Il est ivre si son accusateur était bon."
      },
      {
        "id": "Banshee",
        "reason": "Si le Léviathan est en jeu, et si la Banshee meurt par exécution, tous les joueurs apprennent que la Banshee est morte, et la Banshee acquiert sa capacité."
      },
	  {
        "id": "Mayor",
        "reason": "Si le Léviathan est en jeu et qu'il n'y a pas d'exécution le cinquième jour, les bons gagnent."
      },
      {
        "id": "Hatter",
        "reason": "Si le Chapelier est mort durant ou après le jour 5, le Démon ne peut pas choisir de devenir Léviathan."
      },
      {
        "id": "Pit-Hag",
        "reason": "Après le jour 5, le Chaudronnier ne peut pas créer de Léviathan."
      }
    ]
  },
  {
    "id": "Riot",
    "hatred": [
      {
        "id": "Investigator",
        "reason": "Les Émeutes apparaîssent comme des Sbires pour l'Enquêteur."
      },
      {
        "id": "Clockmaker",
        "reason": "Les Émeutes apparaîssent comme des Sbires pour l'Horloger."
      },
      {
        "id": "Grandmother",
        "reason": "Si un joueur des Émeutes accuse et tue le petit-fils, la Grand-mère meurt aussi."
      },
      {
        "id": "Preacher",
        "reason": "Les Émeutes apparaîssent comme des Sbires pour le Prêcheur."
      },
      {
        "id": "King",
        "reason": "Si un joueur des Émeutes accuse et tue le Roi, et si l'Enfant de Choeur est en vie, l'Enfant de Choeur utilise sa capacité cette nuit."
      },
      {
        "id": "Flowergirl",
        "reason": "Seul un de ces personnages peut être en jeu."
      },
      {
        "id": "Town Crier",
        "reason": "Les Émeutes apparaîssent comme des Sbires pour le Crieur public."
      },
      {
        "id": "Undertaker",
        "reason": "Les joueurs qui meurent par accusation apparaîssent comme exécutés pour le Fossoyeur."
      },
      {
        "id": "Innkeeper",
        "reason": "Si un joueur des Émeutes accuse un joueur protégé par l'Aubergiste, ce joueur ne meurt pas."
      },
      {
        "id": "Monk",
        "reason": "Si un joueur des Émeutes accuse un joueur protégé par le Moine, ce joueur ne meurt pas."
      },
      {
        "id": "Exorcist",
        "reason": "Seul un de ces personnages peut être en jeu."
      },
      {
        "id": "Engineer",
        "reason": "Les Émeutes et l'Ingénieur ne peuvent pas être tous les deux en jeu au début de la partie. Si l'ingénieur crée une Émeute, tous les joueurs mauvais deviennent des Émeutes."
      },
      {
        "id": "Soldier",
        "reason": "Si un joueur des Émeutes accuse le Soldat, le Soldat ne meurt pas."
      },
      {
        "id": "Cannibal",
        "reason": "Les joueurs qui meurent par accusation apparaîssent comme exécutés pour le Cannibale."
      },
      {
        "id": "Minstrel",
        "reason": "Seul un de ces personnages peut être en jeu."
      },
      {
        "id": "Farmer",
        "reason": "Si un joueur des Émeutes accuse et tue un Fermier, le Fermier utilise sa capacité cette nuit."
      },
      {
        "id": "Ravenkeeper",
        "reason": "Si un joueur des Émeutes accuse et tue l'Ami des corbeaux, l'Ami des corbeaux utilise sa capacité cette nuit."
      },
      {
        "id": "Sage",
        "reason": "Si un joueur des Émeutes accuse et tue le Sage, le Sage utilise sa capacité cette nuit."
      },
      {
        "id": "Banshee",
        "reason": "Si un joueur des Émeutes accuse et tue la Banshee, tous les joueurs apprennent que la Banshee est morte, et la Banshee peut immédiatement accuser deux joueurs."
      },
      {
        "id": "Mayor",
        "reason": "Si le 3ème jour commence avec seulement 3 joueurs en vie, les joueurs peuvent (collectivement) décider de ne pas accuser. S'il le font (et si le Maire est en vie) l'équipe du Maire gagne."
      },
      {
        "id": "Pacifist",
        "reason": "Les joueurs qui meurent par accusation apparaîssent comme exécutés pour le Pacifiste."
      },
      {
        "id": "Butler",
        "reason": "Le Majordome ne peut pas accuser son maître."
      },
	  {
        "id": "Golem",
        "reason": "Si le Golem accuse une Émeute, ce joueur ne meurt pas."
      },
      {
        "id": "Saint",
        "reason": "Si un joueur bon accuse et tue le Saint, l'équipe du Saint perd."
      },
	  {
        "id": "Hatter",
        "reason": "Si à la mort du Chapelier, une Émeute choisit de devenir un autre Démon, les autres Émeutes doivent devenir des Sbires. Si à la mort du Chapelier, le Démon choisit de devenir Émeute, les Sbires deviennent des Émeutes aussi."
      },
      {
        "id": "Zealot",
        "reason": "Si le Fanatique est accusé, il doit accuser lui aussi, même s'il est mort."
      },
      {
        "id": "Damsel",
        "reason": "Les Émeutes apparaîssent comme des Sbires pour la Demoiselle."
      },
      {
        "id": "Snitch",
        "reason": "Si le Cafteur est en jeu, chaque joueur des Émeutes reçoit 3 bluffs supplémentaires."
      },
      {
        "id": "Devil's Advocate",
        "reason": "Les joueurs qui meurent par accusation apparaîssent comme exécutés pour l'Avocat du Diable."
      },
      {
        "id": "Pit-Hag",
        "reason": "Si le Chaudronnier crée une Émeute, tous les joueurs mauvais deviennent des Émeutes. Si le Chaudronnier crée une Émeute après le jour 3, la partie continue pour un jour de plus."
      }
    ]
  }
]
